<a href="https://colab.research.google.com/github/thousandoaks/Python4DS101/blob/master/Pandas_Apply.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  Applying functions to a pandas `DataFrame`

**Learning Objectives:**
  *  Apply functions to a Pandas `DataFrame`

## Let's import pandas and load the titanic dataset

In [4]:
import pandas as pd
import numpy as np
titanic = pd.read_csv("https://raw.githubusercontent.com/thousandoaks/Python4DS101/master/data/titanic.csv", sep=",")

In [11]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Applying built-in functions to a pandas `DataFrame`

The following code computes the square root of every element of the column `Age`

We use `pandas.appply()`
Refer to: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html

In [10]:
titanic['Age'].apply(np.sqrt)

0      4.690416
1      6.164414
2      5.099020
3      5.916080
4      5.916080
         ...
886    5.196152
887    4.358899
888         NaN
889    5.099020
890    5.656854
Name: Age, Length: 891, dtype: float64

The following code computes the natural logarithm of every element of the column `Fare`

In [12]:
titanic['Fare'].apply(np.log)

0      1.981001
1      4.266662
2      2.070022
3      3.972177
4      2.085672
         ...
886    2.564949
887    3.401197
888    3.154870
889    3.401197
890    2.047693
Name: Fare, Length: 891, dtype: float64

## Applying regular functions to a pandas `DataFrame`

The following code defines a function to convert dollars to yuans and then have it applied to the column `Fare`

In [17]:
def dolar_to_yuan(amount):
    yuanDolarExchangeRate=6.4
    internalVariable=amount*yuanDolarExchangeRate
    return(internalVariable)

In [18]:
titanic['Fare'].apply(dolar_to_yuan)

0       46.40000
1      456.21312
2       50.72000
3      339.84000
4       51.52000
         ...
886     83.20000
887    192.00000
888    150.08000
889    192.00000
890     49.60000
Name: Fare, Length: 891, dtype: float64

## Applying lambda functions to a pandas `DataFrame`

The following applies a lambda function to transform the columns `Name`

In [20]:
titanic['Name'].apply(lambda x:x.upper())

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

The following applies a lambda function to transform `Fare` from dollars into thousands of Yuans

In [23]:
titanic['Fare'].apply(lambda x:x*6.4/1000)

0      0.046400
1      0.456213
2      0.050720
3      0.339840
4      0.051520
         ...
886    0.083200
887    0.192000
888    0.150080
889    0.192000
890    0.049600
Name: Fare, Length: 891, dtype: float64